app/controllers/users_controller.rb

  def show
    @types = @user.types.all
---
SELECT "types".* FROM "types" INNER JOIN "channels" ON "types"."id" = "channels"."type_id" WHERE "channels"."user_id" = $1  [["user_id", 1]]